Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: དམ་ཚིག་ལས་མི་འདའ་ཞིང་ཚིག་གིས་ལམ་ལ་འཇོག་པར་བྱེད་པ། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་གཅོད་པར་བྱེད་པ་ཡིན་ཏེ
en: They prevent beings from breaking their samaya vows, establish them on the path of the teachings, and keep the lineages of the Three Jewels from breaking up.

source: འདི་ལྟ་སྟེ།
en: They were: {1.42}

source: གཙུག་ཏོར་དང་། མངོན་པར་འཕགས་པ་དང་། མངོན་པར་མཐོ་བ་དང་། གདུགས་དཀར་པོ་དང་། འདབ་མ་མཐའ་ཡས་དང་། འདབ་མ་བརྒྱ་པ་དང་། རྒྱལ་བའི་གཙུག་ཏོར་དང་། འཇིག་རྟེན་མཐོན་པོ་དང་། རྣམ་པར་རྒྱལ་བའི་གཙུག་ཏོར་དང་། མངོན་པར་འཕགས་པའི་གཙུག་ཏོར་དང་། པདྨའི་འོད་དང་། མེ་ཏོག་པདྨའི་འོད་དང་། མེ་ཏོག་ཀ་ཏ་ཀའི་འོད་དང་། འོད་དཀར་པོ་དང་། བཀོད་པའི་གཙུག་ཏོར་དང་། གསེར་གྱི་ཕུང་པོ་དང་། དཀར་པོའི་ཕུང་པོ་དང་། གཟི་བརྗིད་ཕུང་པོ་དང་། ནོར་བུའི་ཕུང་པོ་དང་། ཀུན་ནས་ཕུང་པོ་དང་། རྣམ་པར་གྲགས་པའི་ཕུང་པོ་དང་། འབྱུང་བའི་ཕུང་པོ་དང་། བདེན་པའི་ཕུང་པོ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོའི་ཕུང་པོ་དང་། དེ་ཁོ་ན་ཉིད་ཀྱི་ཕུང་པོ་དང་།
en: Uṣṇīṣa , Atyadbhuta, Atyunnata, Sitātapatra, Anantapatra, Śatapatra, Jayoṣṇīṣa, Lokottara, Vijayoṣṇīṣa, Abhyudgatoṣṇīṣa, Kamalaraśmi, Kanakaraśmi, Sitaraśmi, Vyūḍhoṣṇīṣa, Kanakarāśi, Sitarāśi, Tejorāśi, Maṇirāśi, Samanantarāśi, Vikhyātarāśi, Bhūtarāśi, Satyarāśi, Abhāva­svabhāva­rāśi, and Avitatharāśi. {1.43}

source: དེ་དག་དང་གཞན་ཡང་གཙུག་ཏོར་གྱི་རྒྱལ་པོ་ཆོས་ཀྱི་དབྱིངས་མཐའ་ཡས་པ་ལ་རབ་ཏུ་ཞུགས་པ། སེམས་ཅན་གྱི་བསམ་པ་རབ་ཏུ་རྫོགས་པར་བྱེད་པ་རྒྱལ་བ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་དང་ལྡན་པ་གཙུག་ཏོར་ཀྱི་རྒྱལ་མོ་བསྐལ་པ་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་གི་བར་དུ་ཡང་བགྲང་ཞིང་མཐར་ཐུག་པར་མི་ནུས་སོ། །
en: Lord Śākyamuni dwelt with these and other uṣṇīṣa kings, who abide in the sphere of phenomena fulfilling the heart aspirations of beings and pursuing the heart essence of all the victorious ones, in the realm of the Pure Abode. It would be impossible to list all of these uṣṇīṣa kings down to the last one,

source: སྟོབས་དང་ཕ་རོལ་གནོན་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་བདག་ཉིད་ཀྱང་བསྟན་པར་མི་ནུས་སོ། །
en: or to describe their greatness, with their inconceivable might and powers, even in hundreds of thousands of millions of eons.

source: མདོར་བསྟན་པར་བྱ་སྟེ་བརྗོད་པ་ནི་རིག་པའི་རྒྱལ་མོའི་འདུས་པ་བརྗོད་པར་བྱ་སྟེ།
en: Therefore, they are described here only briefly in an abbreviated form. {1.44}

source: འདི་ལྟ་སྟེ་མཛོད་སྤུ་དང་སྨིན་མ་དང་སྤྱན་དང་རྫི་མ་དང་། རྣ་བ་དང་མགྲིན་པ་དང་། མི་འཇིགས་པ་དང་སྙིང་རྗེ་དང་བྱམས་པ་དང་། བརྩེ་བ་དང་ཤེས་རབ་དང་འོད་ཟེར་དང་སེམས་པ་དང་། འོད་དང་དྲི་མ་མེད་པ་དང་སྒྲིབ་པ་དང་། མཆོག་སྦྱིན་ཐམས་ཅད་དང་།
en: The gathering of vidyārājñīs will now be enumerated: Ūrṇā , Bhrū, Locanā, Pakṣmā, Śravaṇā , Grīvā, Abhayā, Karuṇā, Maitrī, Kṛpā, Prajñā, Raśmi, Cetanā, Prabhā, Nirmalā, and Dhavalā. {1.45}

source: དེ་དག་དང་གཞན་ཡང་རིག་པའི་རྒྱལ་མོ་མཐའ་ཡས་མུ་མེད་པ་དག་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལས་སྤྲོས་པ་དག་ནི་འདི་ལྟ་སྟེ།
en: Along with the vidyārājñīs, emitted from the infinite and unbounded form of the tathāgatas, there were others, namely:

source: དེ་བཞིན་གཤེགས་པའི་སྣོད་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་དང་། དེ་བཞིན་གཤེགས་པའི་གཟིམས་མལ་དང་། དེ་བཞིན་གཤེགས་པའི་སྣང་བ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་དང་། དེ་བཞིན་གཤེགས་པའི་ཞལ་དང་། དེ་བཞིན་གཤེགས་པའི་བརླ་དང་། དེ་བཞིན་གཤེགས་པའི་རྒྱལ་མཚན་དང་། དེ་བཞིན་གཤེགས་པའི་ཏོག་དང་། དེ་བཞིན་གཤེགས་པའི་ཕྱག་མཚན་དང་།
en: Tathāgata’s Bowl, Tathāgata’s Dharma Wheel, Tathāgata’s Couch, Tathāgata’s Splendor, Tathāgata’s Speech, Tathāgata’s Lip, Tathāgata’s Thigh, Tathāgata’s Purity, Tathāgata’s Banner, Tathāgata’s Ensign, and Tathāgata’s Sign. {1.46}

source: དེ་དག་དང་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་སྔགས་བརྗོད་པ་རིག་པའི་རྒྱལ་པོ་དང་། རྒྱལ་མོ་དང་མངག་གཞུག་པ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ཕོ་ཉ་དང་། ཕོ་ཉ་མོ་དང་། གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་མོ་དང་། སེམས་ཅན་དང་། སེམས་ཅན་མ་ཡིན་པ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཁྱད་པར་རྒྱུ་མཐུན་པ་ལས་བྱུང་བའི་རྒྱན་གྱི་ཚོགས་ཀྱི་ཁྱད་པར་དང་།
en: Lord Śākyamuni dwelt with these and with other beings—the vidyārāja s and vidyārājñīs, the ceṭas and ceṭīs, the dūtas and dūtīs, the yakṣa s and yakṣiṇīs, and other sentient and non-sentient beings—uttering tathāgata mantras, created out of the Cloud of Dharma, and distinguishable by their adornments. They were themselves a product of special samādhis,

source: འཁོར་བརྒྱ་སྟོང་བྱེ་བ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དང་། རིག་པའི་རྒྱལ་པོ་རིག་པའི་ཚོགས་ཐམས་ཅད་ཀྱི་གོང་ནས་གོང་དུ་ཡོངས་སུ་གནས་པ་དེ་དག་ཀྱང་གནས་གཙང་མའི་གཞལ་མེད་ཁང་དེར་གནས་པར་གྱུར་ཏོ། །
en: surrounded by enormous retinues of hundreds of thousands of millions, vidyārāja s ranking at the top of all the groups of vidyā beings . They also dwelt in the realm of the Pure Abode.

source: རིག་པའི་རྒྱལ་པོ་པདྨའི་རིགས་ཀྱང་འདི་ལྟ་སྟེ།
en: Among the vidyārāja s belonging to the Lotus family , there were: {1.47}

source: བཅོམ་ལྡན་འདས་ཕྱག་བཅུ་གཉིས་པ་དང་། ཕྱག་དྲུག་པ་དང་། ཕྱག་བཞི་པ་དང་། ཧཱ་ལ་ཧཱ་ལ་དང་། དོན་ཡོད་ཞགས་པ་དང་། རྟ་མགྲིན་དཀར་པོ་དང་། མགྲིན་པ་མཐའ་ཡས་དང་། མགྲིན་སྔོན་དང་། མགྲིན་བཟང་དང་། །མགུལ་བཟང་དང་། མགུལ་དཀར་དང་། མགུལ་སྔོན་དང་། འཇིག་རྟེན་མགུལ་པ་དང་། རྣམ་པར་ལྟ་བ་དང་། ལྟ་བ་དང་། ཀུན་ཏུ་ལྟ་བ་དང་། དབང་ཕྱུག་དང་། འོད་ཟེར་སྟོང་ལྡན་དང་། ཡིད་དང་། ཡིད་ལས་བྱུང་བ་དང་། རྣམ་པར་གྲགས་པའི་ཡིད་དང་། པདྨ་དང་། ཕྱག་ན་པདྨ་དང་། ཡིད་ལ་བསམ་པ་དང་། དབུགས་འབྱིན་དང་། རབ་ཏུ་རྒོད་པ་དང་། སྐྲ་བཟང་དང་། སྐྲ་མཐར་བྱེད་དང་། རྒྱུ་སྐར་དང་། རྒྱུ་སྐར་གྱི་རྒྱལ་པོ་དང་། ཞི་བ་དང་། བསྐལ་པ་བཟང་པོ་དང་། འདུལ་བྱེད་མཆོག་སྟེ།
en: The lords, Dvādaśabhuja, Ṣaḍbhuja, Caturbhuja, Halāhala, Amoghapāśa, White Hayagrīva, Anantagrīva, Nīlagrīva, Sugrīva, Sukarṇa, Śvetakarṇa, Nīlakaṇṭha, Lokakaṇṭha, Vilokita, Avalokita, Īśvara, Sahasraraśmi, Manas, Manasa, Vikhyātamanasa, Kamala, Kamalapāṇi, Manoratha , Āśvāsaka, Prahasita, Sukeśa, Keśānta, Nakṣatra , Nakṣatrarāja, Saumya, Sugata, and Damaka. {1.48}

source: དེ་དག་དང་གཞན་ཡང་རིག་པའི་རྒྱལ་པོ་པདྨའི་གཙུག་ཏོར་ལ་སོགས་པ་དང་། བསྒྲུབ་པ་མཐའ་ཡས་པའི་ཆོས་ཀྱི་ཚོགས་ཀྱི་རྒྱུ་མཐུན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པ།
en: He dwelt with these and with other vidyārāja s, headed by Abjoṣṇīṣa, who had attained the samādhis arising from the infinite accomplishment, the Cloud of Dharma,

source: རིག་པའི་འཁོར་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་དང་། རིག་པའི་རྒྱལ་མོ་དུ་མ་དག་དང་། འཇིག་རྟེན་དབང་ཕྱུག་གི་སྐུའི་ཏིང་ངེ་འཛིན་ལས་བྱུང་བ། འདི་ལྟ་སྟེ།
en: and who were surrounded by many hundreds of thousands of millions of vidyā s and many vidyārājñīs created through the form-samādhi of the lord of the world. These vidyārājñīs were: {1.49}

source: སྒྲོལ་མ་དང་། སྒྲོལ་མ་བཟང་པོ་དང་། གར་མཁན་མ་དང་། ཁྲོ་གཉེར་མ་དང་། འགྲོ་བ་མཐའ་ཡས་དང་། འཇིག་རྟེན་འགྲོ་མ་དང་། ས་ཐོབ་པར་འགྲོ་བ་དང་། དྲི་མ་མེད་པར་འགྲོ་བ་དང་། དཀར་མོ་དང་། དཀར་མོ་མ་དང་། དཀར་མོ་ཆེན་མོ་དང་། གོས་དཀར་མོ་དང་། འཇིག་རྟེན་གནས་པ་དང་། དྲི་མ་མེད་པའི་གནས་མ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་གནས་མ་དང་། པདྨ་ལ་གནས་མ་དང་། སྟོབས་བཅུ་ལ་གནས་མ་དང་། གྲགས་ལྡན་མ་དང་། ལོངས་སྤྱོད་ལྡན་མ་དང་། ལོངས་སྤྱོད་ཆེ་ལྡན་མ་དང་། འུག་པ་མ་དང་། འུག་པ་མ་མ་ཡིན་པ་དང་། དྲི་མེད་མཐའ་ཡས་མ་དང་། ཀུན་ནས་མཐར་བྱེད་མ་དང་། སྡུག་བསྔལ་མཐར་བྱེད་མ་དང་། འབྱུང་པོ་མཐར་བྱེད་མ་དང་། དཔལ་བྱེད་མ་དང་། དཔལ་བྱེད་ཆེན་མོ་དང་། མཆོད་དཔལ་དང་། མཐའ་ཡས་དཔལ་དང་། འཇིག་རྟེན་དཔལ་དང་། རྣམ་པར་གྲགས་པའི་དཔལ་དང་། འཇིག་རྟེན་མ་དང་། ཀུན་ཏུ་མ་དང་། སངས་རྒྱས་ཡུམ་དང་། ཆུ་བོ་མ་དང་། ཤིང་རྟ་བཟང་མོ་དང་། ཤིང་རྟ་ལྡན་མ་དང་། གླང་པོ་འདུལ་བྱེད་མ་དང་། འདུལ་བྱེད་མ་དང་། འབྱུང་པོ་ལྡན་མ་དང་། དཔལ་བྱེད་མ་དང་། ཕྲེང་བ་མ་དང་། ལོངས་སྤྱོད་ཕྲེང་བ་མ་དང་། འགུགས་བྱེད་མ་དང་། རྨད་བྱུང་མ་དང་། འོད་ཅན་མ་དང་། རོ་བཟང་མ་དང་། ནོར་ཆང་ལྡན་མ་དང་། དགའ་ལྡན་མ་དང་། འོད་ལྡན་མ་དང་། དཔའ་མོ་དང་། ཀུན་འགྲོ་མ་དང་། ཟླ་འོད་མ་དང་། ཟླ་བ་མ་དང་། ཟླ་ལྡན་མ་དང་། རྨ་བྱ་མ་དང་། རྨ་བྱ་ཆེན་མོ་དང་། ནོར་ལྡན་མ་དང་། ནོར་སྦྱིན་མ་དང་། ལྷ་ལྡན་མ་དང་། འཇིག་རྟེན་ལྡན་མ་དང་། མེ་ཆེན་མ་དང་། ཆེན་མོ་ཉིད་དང་། སྐྲ་མཛེས་མ་དང་། དགའ་བཟང་མ་དང་། ནོར་སྦྱིན་མ་དང་། དཔལ་མོ་དང་། དཔལ་ལྡན་མ་དང་། ནད་མཐར་བྱེད་མ་དང་། ནད་ཐམས་ཅད་གསོ་བར་བྱེད་མ་དང་། མཉམ་མེད་མ་དང་། ལྷ་མོ་དང་། གྲགས་བྱེད་མ་དང་། དབང་དུ་བྱེད་མ་དང་། མྱུར་དུ་བྱེད་མ་དང་། བདེ་སྦྱིན་མ་དང་། བཀྲ་ཤིས་མ་དང་། བཀྲ་ཤིས་བྱེད་མ་དང་། ཟླ་བ་མ་དང་། ཟླ་མཛེས་མ་དང་། ཟླ་ལྡན་མ་དང་།
en: Tārā, Sutārā, Naṭī, Bhṛkuṭī, Anantaṭī, Lokaṭī, Bhūmiprāpaṭī, Vimalaṭī, Sitā , Śvetā, Mahāśvetā, Pāṇḍaravāsinī, Lokavāsinī, Vimalavāsinī, Abjavāsinī, Daśabalavāsinī, Yaśovatī , Bhogavatī, Mahābhogavatī, Ulūkā, Alūkā, Amalāntakarī, Vimalāntakarī, Samantāntakarī, Duḥkhāntakarī, Bhūtāntakarī, Śriyā , Mahāśriyā, Stupaśriyā, Anantaśriyā, Lokaśriyā, Vikhyātaśriyā, Lokamātā , Samantamātā, Buddhamātā, Bhaginī, Bhāgīrathī, Surathī, Rathavatī, Nāgadantā, Damanī, Bhūtavatī, Amitā, Āvalī, Bhogāvalī, Ākarṣaṇī, Adbhutā, Raśmī, Surasā, Suravatī, Pramodā, Dyutivatī, Taṭī, Samantataṭī, Jyotsnā, Somā, Somāvatī, Māyūrī, Mahāmāyūrī, Dhanavatī, Dhanandadā, Suravatī, Lokavatī, Arciṣmatī, Bṛhannalā, Bṛhantā, Sughoṣā, Sunandā, Vasudā, Lakṣmī, Lakṣmīvatī, Rogāntikā, Sarva­vyādhi­cikitsanī, Asamā, Devī , Khyātikarī, Vaśakarī, Kṣiprakarī, Kṣemadā, Maṅgalā, Maṅgalāvahā, Candrā, Sucandrā, and Candrāvatī. {1.50}

source: བདག་དང་གཞན་ཡང་རིག་པའི་རྒྱལ་མོ་དག་ལ་རི་ཁྲོད་མ་ལོ་མ་གྱོན་མ་དང་། མྱ་ངན་ལས་སྐྱེས་མ་དང་། ཡིད་ལས་སྐྱེས་མ་ལ་སོགས་པ་གྲུབ་པ་མཐའ་ཡས་པས་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའ་དང་འདྲ་བའི་ངོ་བོ་དང་། སེམས་ཅན་གྱི་སྤྱོད་པའི་རྣམ་པར་འཕྲུལ་པ་གནས་པ་ལས་བྱུང་བའི་ཡིད་དང་། ཕོ་ཉ་དང་། ཕོ་ཉ་མོ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། མངག་གཞུག་པ་དང་། མངག་གཞུག་མ་དང་། གནོད་སྦྱིན་དང་། གནོད་སྦྱིན་མོ་དང་། སྲིན་པོ་དང་། སྲིན་མོ་དང་། ཤ་ཟ་དང་། ཤ་ཟ་མོ་དང་། པདྨའི་རིགས་དམ་ཚིག་ལ་རྗེས་སུ་ཞུགས་ཤིང་རྗེས་སུ་སྤྱོད་པ་རྣམས་དང་། གནས་གཙང་མའི་ལྷའི་གཞལ་མེད་ཁང་སེམས་ཅན་དག་པ་གང་ན་འདུག་པ་དེར་ཕྱིན་པར་གྱུར་ཏོ། །
en: These and other vidyārājñīs, headed by Parṇaśavarī, Jāṅgulī, and Mānasī, whose accomplishment is limitless, who have the nature of the space of the sphere of phenomena, and whose mental states arise due to the presence of the bodhisattva conduct and marvels—the dūtas and dūtīs, ceṭas and ceṭīs, kiṃkaras and kiṃkarīs, yakṣa s and yakṣiṇīs, rākṣasas and rākṣasīs, and piśācas and piśācīs who have taken the samaya vows of the Lotus family and perform the mantra practice—also dwelt in the gods’ realm of the Pure Abode inhabited by pure beings.

source: ཕྱིན་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ལ་མཆོད་པའི་ལས་ལ་བརྩོན་པའི་ཡིད་ཀྱིས་གནས་པར་གྱུར་ཏོ། །
en: Staying there, they remained wholly preoccupied with acts of worship of Lord Śākyamuni. {1.51}

source: དེར་གནས་པ་ན་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཉེ་བ་ན་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱག་ན་རྡོ་རྗེས་རང་གི་རིག་པའི་ཚོགས་རྣམས་ལ་སྨྲས་པ།
en: In Lord Śākyamuni’s presence, the bodhisattva Vajrapāṇi then summoned his own retinue of vidyā s, saying,

source: ངའི་རིག་པའི་ཚོགས་ཀྱིས་བསྐོར་བའི་རིག་པའི་རྒྱལ་པོ་དང་རྒྱལ་མོ་ཁྲོ་བོའི་རྒྱལ་པོ་དང་། ཕོ་ཉ་ཆེན་མོ་དང་བཅས་པ་ཁྱེད་ཅག་འདིར་འདུས་པར་གྱིས་ཤིག །
en: “Please gather here, venerable friends—hosts of vidyā s of my retinue—krodharājas, vidyārāja s and vidyārājñīs, and great dūtīs!”

source: དྲན་པ་ཙམ་ཉིད་ཀྱིས་རིག་པའི་ཚོགས་ཐམས་ཅད་འདུས་པར་གྱུར་པ་ནི་འདི་ལྟ་སྟེ།
en: Then, merely by the power of thought, all the multitudes of vidyā beings were gathered. The male vidyā beings were: {1.52}

source: རིག་པ་མཆོག་དང་། རིག་པ་བཟང་པོ་དང་། གྲུབ་པ་བཟང་པོ་དང་། དཔུང་བཟང་དང་། སྡེ་བཟང་དང་། ལྷ་མཐར་བྱེད་དང་། སོ་བཟང་དང་། གང་བ་བཟང་པོ་དང་། རྡོ་རྗེ་སྡེ་དང་། རྡོ་རྗེ་མཐར་བྱེད་དང་། རྡོ་རྗེ་བྱེད་པ་དང་། རྡོ་རྗེ་དཔུང་པ་དང་། རྡོ་རྗེ་ལག་པ་དང་། རྡོ་རྗེ་རྒྱལ་མཚན་དང་། །རྡོ་རྗེ་བ་དན་དང་། རྡོ་རྗེ་རྩེ་མོ་དང་། རྡོ་རྗེ་མཆེ་བ་དང་། དག་པའི་རྡོ་རྗེ་དང་། རྡོ་རྗེ་བ་སྤུ་དང་། རྡོ་རྗེ་མཁྲེགས་པ་དང་། རྡོ་རྗེ་ཞལ་དང་། རྡོ་རྗེ་གོ་ཆ་དང་། རྡོ་རྗེ་མགྲིན་པ་དང་། རྡོ་རྗེ་མཐོན་ཀ་དང་། རྡོ་རྗེ་ལྟེ་བ་དང་། རྡོ་རྗེ་རྩེ་མོ་དང་། རྡོ་རྗེ་དྲ་བ་དང་། རྡོ་རྗེ་ར་བ་དང་། །རྡོ་རྗེ་མཚོན་ཆ་དང་། རྡོ་རྗེ་གཞུ་དང་། རྡོ་རྗེ་མདའ་དང་། རྡོ་རྗེ་ལྕགས་མདའ་དང་། རྡོ་རྗེས་མཚོན་པ་དང་། རྡོ་རྗེ་ལྕགས་སྒྲོག་དང་། རྡོ་རྗེ་ས་འོག་དང་། རྡོ་རྗེ་འཇིགས་བྱེད་སྤྱན་དང་རྡོ་རྗེ་ཁྲོ་མོ་དང་། ཆུ་ནང་སྤྱོད་དང་། འབྱུང་བའི་ནང་སྤྱོད་དང་། འཆིང་བའི་ནང་སྤྱོད་དང་། །ཁྲོ་བོ་ཆེན་པོའི་ནང་སྤྱོད་དང་། དབང་ཕྱུག་ཆེན་པོའི་ནང་སྤྱོད་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོའི་ནང་སྤྱོད་དང་། རེག་པ་ཐམས་ཅད་ཀྱི་ནང་སྤྱོད་དང་། མི་བཟད་པ་དང་། ཤིན་ཏུ་མི་བཟད་པ་དང་། འཕེན་པ་དང་། ཉེ་བར་འཕེན་པ་དང་། རྐང་པ་འཕེན་པ་དང་། ལོག་འདྲེན་གྱི་ནང་དུ་འཕེན་པ་དང་། ལོགས་པར་རྣམ་པར་འཇོག་པའི་འཕེན་པ་དང་། ཆོལ་པར་འཕེན་པ་དང་། སྟོབས་དང་སྟོབས་པོ་ཆེ་དང་། ནེ་ཙོ་དང་། བུང་བ་དང་། བྷྲིང་གི་རི་ཏི་དང་། ཁྲོ་བོ་དང་། ཁྲོ་བོ་ཆེན་པོ་དང་། ཁྲོ་བོ་ཐམས་ཅད་དང་། རྒ་བ་མེད་པ་དང་། ཀླུ་ཆེན་པོ་དང་། རིམས་དང་། སྐེམ་བྱེད་དང་། ཀླུ་མཐར་བྱེད་དང་། དབྱུག་པ་དང་། དབྱུག་སྔོན་དང་། དཔུང་རྒྱན་དང་། ལུས་དམར་དང་། རྡོ་རྗེ་དབྱུག་པ་དང་། སྤྲིན་དང་། སྤྲིན་ཆེན་པོ་དང་། དུས་དང་། དུག་དང་། ཤ་ཟ་གུ་དང་། ནད་དང་། འབྱུང་པོ་ཐམས་ཅད་ཡང་དག་པར་འཁྲུག་པར་བྱེད་པ་དང་། གཟེར་ནད་དང་། གཟེར་ནད་ཆེན་པོ་ཉམ་ཐག་པ་དང་། ཉམ་ཐག་པ་ཆེན་པོ་དང་། གཤིན་རྗེ་དང་། ཉི་མའི་བུ་དང་། དུས་མཐར་བྱེད་དང་། ནག་པོའི་ཕྱོགས་དང་། མི་བཟད་པའི་གཟུགས་ཅན་དང་། པ་ཊི་སྱ་དང་། མདའ་བོ་ཆེ་དང་། སྒྲ་རྣམ་པར་འཇོམས་པ་དང་། ཟ་བར་བྱེད་པ་དང་། ཚོགས་དང་། ཉི་མ་དང་། དུས་ཀྱི་མཐའི་ཉི་མ་དང་། སྲོག་འཕྲོག་བྱེད་དང་། སྲོག་འཇོམས་བྱེད་དང་། ཞེ་སྡང་དང་། ཕྲག་དོག་དང་། ཐབ་སྦྱོར་ཅན་དང་། ཐབ་སྦྱོར་བཟང་པོ་ཅན་དང་། བདུད་རྩི་ཐབ་སྦྱོར་ཅན་དང་། མཐའ་ཡས་ཐབ་སྦྱོར་ཅན་དང་། ཐབ་སྦྱོར་དམར་པོ་ཅན་དང་། ལག་པ་དང་། ལག་པ་ཆེན་པོ་དང་། ཁྲོ་བོ་ཆེན་པོ་དང་། མ་རུངས་པ་དང་། སྦྲུལ་དང་། འགོ་བའི་ནད་དང་། མཛེ་དང་། རྒྱལ་བྱེད་ཤིང་རྟ་དང་། འཇིགས་བྱེད་ཤིང་རྟ་དང་། རྣམ་པར་ཞུ་བྱེད་དང་། ཟ་བྱེད་དང་། མི་ངོམས་པ་དང་། འཆོལ་བ་དང་། བྲན་ཏེ་
en: Vidyottama, Suvidya, Susiddha, Subāhu , Suṣeṇa, Surāntaka, Surada, Supūrṇa, Vajrasena, Vajrāntaka, Vajrākara, Vajrabāhu, Vajrahasta, Vajradhvaja, Vajrapatāka, Vajraśikhara, Vajraśikha, Vajradaṃṣṭra, Śuddhavajra, Vajraroman, Vajrasaṃhata, Vajrānana, Vajrakavaca, Vajragrīva, Vajravakṣas, Vajranābhi, Vajrānta, Vajrapañjara, Vajraprākāra, Vajrāstra, Vajradhanuḥ, Vajraśara, Vajranārāca, Vajrāṅka, Vajrasphoṭa, Vajrapāṭāla, Vajrabhairava, Vajranetra, Vajrakrodha , Jalānantaścara, Bhūtāntaścara, Bandhanānantaś­cara, Mahā­vajra­krodhāntaś­cara, Maheśvarāntaś­cara, Dānavendrāntaś­cara, Sarva­vidyāntaś­cara, Ghora, Sughora, Kṣepa, Upakṣepa, Padavikṣepa, Vināya­kānta­kṣepa, Suvinyāsakṣepa, Utkṛṣṭakṣepa, Bala, Mahābala, Sumbha, Bhramara, Bhṛṅgiriṭi, Krodha, Mahākrodha , Sarvakrodha, Ajara, Ajagara, Jvara, Śoṣa, Nāgānta, Daṇḍa, Nīladaṇḍa, Aṅgada, Raktāṅga, Vajradaṇḍa, Megha, Mahāmegha, Kāla, Kālakūṭa, Śvitraroga, Sarva­bhūta­saṃkṣayaka, Śūla , Mahāśūla, Ārti, Mahārti, Yama, Vaivasvata, Yugāntakara, Kṛṣṇapakṣa, Ghora, Ghorarūpin, Paṭṭisa, Tomara, Gada, Pramathana, Grasana, Saṃhāra, Arka, Yugāntārka, Prāṇahara, Śakraghna, Dveṣa, Āmarṣa, Kuṇḍalin, Sukuṇḍalin, Amṛtakuṇḍalin, Anantakuṇḍalin, Ratnakuṇḍalin, Bāhu, Mahābāhu, Mahoraga , Duṣṭasarpa, Visarpa, Kuṣṭha, Upadrava, Vidrava, Vidrāpaka, Bhakṣaka, Atṛṣṇa, and Ucchuṣma. {1.53}

source: དེ་དག་དང་། གཞན་ཡང་རིག་པའི་རྒྱལ་པོ་ཁྲོ་བོ་ཆེན་པོས་སེམས་ཅན་མ་ལུས་པ་མཐའ་དག་འདུལ་བར་བྱེད་པ། བསྐྲད་པ་དང་། འཇིག་པ་དང་། མགོ་འགས་པར་བྱེད་པ་དང་། འཆི་བར་བྱེད་པ་དང་། རྣམ་པར་ཉམས་པར་བྱེད་པ་དང་།
en: These and other vidyārāja s and mahākrodhas who completely tame all beings; who perform the activities of banishing, dispersing, killing, and destroying;

source: གུས་པ་དག་ལ་ནི་མཆོག་སྦྱིན་པར་བྱེད་པ་ཞི་བ་དང་རྒྱས་པ་དང་མངོན་སྤྱོད་ཀྱི་ལས་རྣམས་སྟོན་པར་བྱེད་པ་རིག་པའི་རྒྱལ་པོ་བྱེ་བ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་བ། བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དང་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ངེས་པར་སེམས་ཤིང་བདག་ཉིད་ཀྱི་རིག་པའི་རྒྱལ་པོ་ཕྱག་ན་རྡོ་རྗེ་ལ་ཕྱག་འཚལ་ཞིང་བཀའ་རབ་ཏུ་སྡོད་ཅིང་འདུག་སྟེརང་གི་རིགས་དང་མཐུན་པའི་གནས་ལ་འདུག་ཅིང་རང་གི་སྟན་ལ་འདུག་པར་གྱུར་ཏོ། །
en: who are generous toward worshipers; and who engage in the awakened activities of pacifying, enrichment, and assault, themselves surrounded by their own retinues of hundreds of thousands of millions of vidyārāja s, bowed, in anticipation of orders, to their vidyārāja Vajrapāṇi, who, for his part, was intently observing Lord Śākyamuni and the divine youth Mañjuśrī. All these vidyārāja s sat down on their seats in the places assigned to them according to their buddha family affiliation. {1.54}

source: གང་བཅོམ་ལྡན་འདས་ཕྱག་ན་རྡོ་རྗེ་གང་ཡང་ཕོ་ཉ་མོའི་རིག་པའི་རྒྱལ་མོ་དེ་དག་ཀྱང་འཁོར་བརྒྱ་སྟོང་དུ་མས་བསྐོར་བ་ཡང་རང་གི་ཆོས་ཀྱི་དབྱིངས་ནམ་མཁའི་རང་བཞིན་སྤྲོས་པ་མེད་པ་ལ་དམིགས་ནས་གནས་དེར་འདུས་པ་ལ་འདི་ལྟ་སྟེ།
en: Also the great dūtīs, the messengers of Lord Vajrapāṇi, together with their retinues of thousands of millions of vidyārājñīs, abiding nonconceptually in their own sphere of phenomena that has the nature of the sky, gathered in that place. They were: {1.55}

source: འོག་པག་མ་དང་། འོག་པག་བཟང་མོ་དང་། ལུ་གུ་རྒྱུད་མ་དང་། རྡོ་རྗེ་འོད་མ་དང་། རྡོ་རྗེ་ལྕེ་མ་དང་། རྡོ་རྗེའི་སྦྱིན་མ་དང་། རྡོ་རྗེ་སྤྱན་མ་དང་། རྡོ་རྗེའི་ཐལ་གོང་མ་དང་། རྡོ་རྗེ་ཁྲོ་གཉེར་མ་དང་། རྡོ་རྗེ་རྣ་བ་མ་དང་། རྡོ་རྗེ་ཡི་གེ་མ་དང་། རྡོ་རྗེ་ཁབ་མ་དང་། རྡོ་རྗེ་ཁུ་ཚུར་མ་དང་། རྡོ་རྗེ་ལྕགས་ཀྱུ་མ་དང་། རྡོ་རྗེ་རལ་གྲི་མ་དང་། རྡོ་རྗེ་ཐོག་འབབ་མ་དང་། རྡོ་རྗེ་ལུ་གུ་རྒྱུད་མ་དང་། གནས་དང་ལྡན་མ་དང་། གནས་མ་དང་། རྣམ་པར་བརྗོད་མ་དང་། དགའ་བྲལ་མ་དང་། འདོད་ལྡན་མ་དང་། རྡོ་རྗེ་འདོད་ལྡན་མ་དང་། འདོད་པའི་རྡོ་རྗེ་དང་ལྡན་མ་དང་། མཐོང་བྱེད་མ་དང་། མཐོང་ལྡན་མ་དང་། མཐོང་ལྡན་ཆེན་མོ་དང་། རྩེ་མོར་གནས་མ་དང་། སྟུག་པོ་མ་དང་། ཕུག་ལྡན་མ་དང་། ཕུག་གནས་མ་དང་། སྒོར་གནས་མ་དང་། ཡིད་མགྱོགས་མ་དང་། རབ་ཏུ་མགྱོགས་མ་དང་། མྱུར་མགྱོགས་མ་དང་། སྤྱན་མཛེས་མ་དང་། རོ་བཟང་ལྡན་མ་དང་། བུང་བ་མ་དང་། བུང་བའི་བུ་མ་དང་། འགྲོ་མ་དང་། གྲུབ་མ་དང་། རླུང་མ་དང་། རྩེག་མ་དང་། སྐྲ་ཅན་མ་དང་། སྐྲ་བཟང་མ་དང་། བཤུགས་པ་མ་དང་། སྡིགས་མཛུབ་མ་དང་། ཕོ་ཉ་མོ་དང་། ཕོ་ཉ་མོ་བཟང་མོ་དང་། བདག་གི་མ་དང་། མིའུ་ཐུང་མ་དང་། གཟུགས་ལྡན་མ་དང་། གཟུགས་ཅན་མ་དང་། རྒྱལ་མ་དང་། རྣམ་པར་རྒྱལ་མ་དང་། གཞན་གྱིས་མི་ཐུབ་མ་དང་། དཔལ་ལྡན་མ་དང་། བཞད་ལྡན་མ་དང་། རྡོ་རྗེ་བཞད་མ་དང་། འཇིག་རྟེན་ལྡན་མ་དང་། གྲགས་ལྡན་མ་དང་། རྡོ་རྗེ་ལྡན་མ་དང་། སྦྱིན་མེད་དང་། སྲིད་གསུམ་དབང་བྱེད་མ་དང་། དབྱུག་པ་མ་དང་། དབྱུག་པ་ཆེན་མོ་མ་དང་། སྙན་པར་སྨྲ་བ་མ་དང་། སྐད་བཟང་ལྡན་མ་དང་། དོན་ལྡན་མ་དང་། ཐེག་ཆེན་མ་དང་། སྲེག་པ་མ་དང་། སྲེག་པ་དཀར་པོ་མ་དང་། དཀར་མོ་དང་། སྤྲུལ་བྱེད་བཟང་མོ་དང་། དྲི་མེད་བཟང་མོ་དང་། དྲིལ་བུ་མ་དང་། རལ་གྲི་མ་དང་པཊྚི་ས་དང་། རྒྱལ་བྱེད་མ་དང་། སྒྲ་མེད་མ་དང་། འདུད་མ་དང་། གསང་ལྡན་མ་དང་། དབུགས་འབྱིན་ལྡན་མ་དང་། གཏུམ་མ་དང་། འབྱུང་པོ་ཐམས་ཅད་དབང་དུ་བྱེད་མ་དང་།
en: Mekhalā, Sumekhalā, Śṛṅkhalā, Vajrārṇā, Vajrajihvā, Vajrabhrū, Vajralocanā, Vajrāṃsā, Vajrabhṛkuṭī, Vajraśravaṇā, Vajralekhā, Vajrasūcī, Vajramuṣṭī, Vajrāṅkuśī, Vajraśāṭī, Vajrāsanī, Vajraśṛṅkhalā, Vajraśālavatī, Śālā, Viraṭī, Kāminī, Vajrakāminī, Kāmavajriṇī, Paśyikā, Paśyinī, Mahāpaśyinī, Śikharavāsinī, Guhilā, Guhamatī, Guhavāsī, Dvāravāsinī, Kāmavajriṇī, Manojavā, Atijavā, Śīghrajavā, Sulocanā, Surasavatī, Bhramarī, Bhrāmarī, Yātrā, Siddhā, Anilā, Pūrā, Keśinī, Sukeśā, Hiṇḍinī, Tarjanī, Dūtī , Sudūtī, Māmakī, Vāmakī, Rūpiṇī , Rūpavatī, Jayā, Vijayā, Ajitā , Aparājitā, Śreyasī, Hāsinī, Hāsavajriṇī, Lokavatī, Yaśavatī, Kuliśavatī, Adāntā, Trailokya­vaśaṅkarī, Daṇḍā, Mahādaṇḍā, Priyavādinī, Saubhāgyavatī, Arthavatī , Mahānarthā, Tittarī, Dhavalatittarī, Dhavalā, Sunirmitā, Sunirmalā, Ghaṇṭā, Khaḍgapaṭṭiśā, Sūcī, Jayantī, Ambarā, Nirmitā, Nāyikā, Guhyakī, Viśrambhikā, Musalā, and Sarva­bhūta­vaśaṅkarī. {1.56}

source: དེ་དག་དང་གཞན་ཡང་ཕོ་ཉ་ཆེན་མོའི་ཚོགས་དུ་མས་ཡོངས་སུ་བསྐོར་བ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་འདུས་པར་གྱུར་ཏོ། །
en: These and other great dūtīs, surrounded by retinues of many other dūtīs, were all gathered in that great assembly.

source: ཏིང་ངེ་འཛིན་གྱི་རྒྱུ་མཐུན་པས་ཡོངས་སུ་བསྒོས་པའི་ཐུགས་ལས་བྱུང་བའི་གཟུངས་ཀྱི་ལྷ་མོ་དུ་མ་རྣམས་སེམས་ཅན་མ་རུངས་པ་ཚར་གཅོད་པ་སྒྲུབ་པར་བྱེད་པ་ལ་འདི་ལྟ་སྟེ།
en: There were also many dhāraṇī goddesses who arise in the mind absorbed in samādhi, and who let their chastising sticks fall upon wicked beings to control them. They were: {1.57}

source: རྡོ་རྗེའི་མེས་རབ་ཏུ་རྨོངས་པར་བྱེད་པའི་གཟུངས་ཀྱི་ལྷ་མོ་དང་། ལྷུན་པོའི་རྩེ་མོའི་ཁང་པ་བརྩེགས་པའི་གཟུངས་དང་། རིན་པོ་ཆེའི་རྩེ་མོའི་ཁང་པ་བརྩེགས་པའི་གཟུངས་དང་འཛིན་མ་དང་། ལེགས་བརྩེགས་མ་དང་། ལག་བརྩེགས་མ་དང་། མེ་ཏོག་བརྩེགས་མ་དང་། ཆད་པའི་གཟུངས་མ་དང་། ཚར་གཅོད་པའི་གཟུངས་མ་དང་། འགུགས་པར་བྱེད་པའི་གཟུངས་མ་དང་། དཔུང་རྒྱན་མ་དང་། དཔུང་རྒྱན་ལྡན་པ་དང་། རྒྱལ་མཚན་མཆོག་གི་དཔུང་རྒྱན་མ་དང་། རིན་ཆེན་མཆོག་གི་དཔུང་རྒྱན་མ་དང་། འཇིག་རྟེན་མཆོག་གི་དཔུང་རྒྱན་མ་དང་། བ་དན་མཆོག་གི་དཔུང་རྒྱན་མ་དང་། ལེའུ་གསུམ་མ་དང་། འཇིག་རྟེན་འཁྱིལ་མ་དང་། སྟོང་འཁྱིལ་མ་དང་། གཤིན་རྗེ་འཁྱིལ་མ་དང་། འབྱུང་པོ་ཐམས་ཅད་འཁྱིལ་མ་དང་། ཏོག་ལྡན་མ་དང་། རིན་ཆེན་ལྡན་མ་དང་། ནོར་བུ་རིན་པོ་ཆེའི་གཙུག་མ་དང་། བྱང་ཆུབ་ཡན་ལག་མ་དང་། སྟོབས་ལྡན་མ་དང་། མཐའ་ཡས་ཏོག་མ་དང་། ཀུན་ཏུ་ཏོག་མ་དང་། རིན་ཆེན་ཏོག་མ་དང་། རྣམ་གྲགས་ཏོག་མ་དང་། འབྱུང་པོ་ཐམས་ཅད་ཀྱི་ཏོག་མ་དང་། འཁོར་ས་ལྡན་མ་དང་། སྒྲ་སྙན་མ་དང་། དྲི་བྲལ་བཟང་མོ་དང་། གདོང་དྲུག་མ་དང་། དྲི་བྲལ་མ་དང་། འཇིག་རྟེན་གྲགས་པ་མ་དང་།
en: Vajrānala­pramohanī­dhāraṇī, Meru­śikhara­kūṭāgārādhāraṇī, Ratna­śikhara­kūṭāgāra­dharaṇiṃdharā, Sukūṭā, Bahukūṭā, Puṣpakūṭā, Daṇḍadhāriṇī, Nigrahadhāraṇī, Ākarṣaṇa­dhāriṇī, Keyūrā, Keyūravatī, Dhvajāgra­keyūrā, Ratnā, Ratnāgrakeyūrā, Lokāgrakeyūrā, Patāgrakeyūrā, Triparivartā, Lokāvartā, Sahasrāvartā, Vivasvatāvartā, Sarva­bhūtāvartā, Ketuvatī, Ratnavatī, Maṇiratnacūḍā, Bodhyaṅgā, Balavatī, Anantaketu , Samantaketu, Ratnaketu , Vikhyātaketu, Sarvabhūtaketu, Ajiravatī, Asvarā, Sunirmalā, Ṣaṇmukhā, Vimalā, and Lokākhyā. {1.58}

source: དེ་དག་དང་གཞན་ཡང་གཟུངས་ཀྱི་ལྷ་མོ་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་བ་དང་འཁོར་གྱི་དཀྱིལ་འཁོར་དེར་འདུས་པར་གྱུར་ཏོ། །
en: These and other dhāraṇī goddesses, surrounded by retinues of many hundreds of thousands of millions of such dhāraṇīs, all gathered in this great assembly.

source: སངས་རྒྱས་མཐའ་ཡས་པས་བྱིན་གྱིས་བརླབས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོའི་ཏིང་ངེ་འཛིན་གྱིས་བྱིན་གྱིས་བརླབས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གཞན་གྱི་སངས་རྒྱས་ཡོངས་སུ་སྤངས་པའི་རང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་བསེ་རུ་ལྟ་བུ་དང་། ཚོགས་ན་སྤྱོད་པ་རྣམས་སེམས་ཅན་རྣམས་ཀྱི་དོན་མཛད་པ་ནི་ཅང་མི་གསུང་བ་གོམས་པས་ཆོས་ཀྱི་ཚུལ་ཡང་དག་པར་སྟོན་པ་ཡིན་ཏེ
en: Through the infinite blessing of the buddhas, and the great blessing of the samādhi of the bodhisattvas, there assembled in this great gathering also venerable pratyeka­buddhas from other buddhafields where there are no tathāgatas present. Among them were both the solitary, rhinoceros-like ones and those who move among people, working for the benefit of beings. They demonstrate the way of the Dharma that involves habituation to silence.

source: འཁོར་བའི་རྗེས་སུ་འཁོར་བས་རྟག་ཏུ་ཡིད་སྐྱོ་ལ། རྒྱུད་ལ་སྙིང་རྗེ་ཆེན་པོ་སྤངས་ཤིང་
en: However, as their mindstreams are devoid of great compassion, they circle in saṃsāra with their minds ever weary.

source: སེམས་ལ་བག་ཆགས་བསྒོས་པ་ཁོ་ན་སྔོན་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ཉིད་ཡོངས་སུ་བསྒོས་པར་སེམས་པ་སྟེ།
en: Their minds brim over with habitual thought patterns, and thus their previously generated bodhicitta is also tainted by habitual thinking.

source: ས་གཅིག་དང་། ས་གཉིས་དང་། ས་གསུམ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་ཀྱི་བར་དུ་འཇུག་པའི་སེམས་དང་འཁོར་བས་སྐྱོ་ཞིང་འཇིགས་ལ་འཇིགས་པར་བྱེད་པ་དེ་དག་ཀྱང་དཀྱིལ་འཁོར་ཆེན་པོ་དེར་འདུས་པར་གྱུར་ཏོ། །
en: Their minds thus stall in progress when they reach the first, second, third . . . or any bodhisattva level up to the eighth, and they are fearful of saṃsāra, with minds ever weary.

source: འདི་ལྟ་སྟེ་སྤོས་ཀྱི་ངད་ལྡང་དང་ཀུན་ནས་སྐྱེ་མཆེད་དང་། ཀུན་དུ་འོད་དང་། དགའ་བོ་དང་དུས་དང་། ཉེ་བའི་དུས་དང་མུ་ཁྱུད་དང་། ཉེ་བའི་མུ་ཁྱུད་དང་། འདོད་པ་དང་ཉེ་བའི་འདོད་པ་དང་། ཕ་རོལ་ཕྱིན་རྟ་དང་། ལེགས་པར་ཕ་རོལ་ཕྱིན་རྟ་དང་། རྔ་བོ་ཆེ་དང་། ཉེ་བའི་རྔ་བོ་ཆེ་དང་། འཇིག་རྟེན་རྣམ་པར་འཇིགས་པར་བྱེད་པ་དང་། རྡུལ་མེད་དང་། རྡུལ་དང་། ཉེ་བའི་རྡུལ་དང་། ཆ་ཤས་དང་། ཉེ་བའི་ཆ་ཤས་དང་། ཕྱག་མཚན་དང་། ཕྱག་མཚན་བཟང་པོ་དང་། ཉིན་བྱེད་དང་། བཟང་བྱེད་དང་། འོད་ལྡན་དང་། འོད་བྱེད་དང་། འཇིག་རྟེན་བྱེད་དང་། རྣམ་གྲགས་དང་ཐོས་མེད་དང་། སྡུག་མཛེས་དང་། དབྱངས་མཛེས་དང་། དུལ་མཛེས་དང་། མཐའ་ཡས་མཐའ་དང་། རྒྱུ་མཐའ་དང་། ཏོག་དཀར་པོ་དང་། ཏོག་གི་ཕྱག་མཚན་དང་། ཏོག་དང་། ཉེ་བའི་ཏོག་དང་། རྒྱལ་དང་། པདྨ་དང་། པདྨ་འབྱུང་བ་དང་། རང་འབྱུང་དང་། སྐྱེས་པ་དང་། ཡིད་དུ་འོང་བ་དང་། ཡིད་ལས་བྱུང་དང་། དབང་ཆེན་དང་། བརྩེགས་པའི་མཚན་དང་། རུ་རྟ་དང་། མ་ལུས་སྤྱན་དང་། བདེ་བྱེད་དང་། ཕན་བྱེད་དང་། ཞི་བ་དང་། ཞི་བའི་ཡིད་དང་། ཆོས་དང་། ཉེ་བའི་ཆོས་དང་། རྣམ་པར་སྣང་མཛད་དང་། མེ་ཏོག་དང་། ལེགས་སྔོ་དང་། དཔལ་ལྡན་དང་། གཉེན་ལས་ཐག་རིང་བྱེད་དང་། བཟོད་པར་དཀའ་བ་དང་། གསེར་དང་། དྲི་མེད་ཏོག་དང་། ཟླ་བ་དང་། ཟླ་བཟང་དང་། སྡེ་བཟང་དང་། བརྟུལ་ཞུགས་ལེགས་སྤྱད་དང་། བརྒྱ་བྱིན་དང་། ཆོས་བྱིན་དང་། འདོད་པ་དང་། ཉེ་དབང་ནོར་ལྷ་དང་།
en: They were: {1.59} Gandhamādana , Samantāyatana, Samantaprabha, Candana, Kāla, Upakāla, Nemi, Upanemi, Riṣṭa, Upariṣṭa, Upāriṣṭa, Pārśva, Supārśva, Dundubhi, Upadundubhi, Lokākhya, Lokaprabha, Jayanta, Areṇu, Reṇu, Upareṇu, Aṃśa, Upāṃśa, Cihna, Sucihna, Dinakara, Sukara, Prabhāvanta, Prabhākara, Lokakara, Viśruta, Suśruta, Sukānta, Sudhānta, Sudānta , Anantānta, Bhavānta, Sitaketu, Cihnaketu, Ketu, Upaketu, Tiṣya, Padmottara, Padmasambhava, Svayambhu, Adbhuta, Manojña, Manasa, Mahendra , Kūṭākhya, Kumbhaka, Saṃlākṣa, Śaṅkara , Upakara, Śānta, Śāntamānasa, Dharma , Upadharma, Vairocana, Kusuma , Sunīla, Śreyasa, Svabandhu­dūrāntaka, Duḥprasaha, Kanaka, Vimalaketu , Soma, Susoma, Suṣeṇa, Sucīrṇa, Śukra, Kratu, Iṣṭa, Upendra, and Vasu. {1.60}
